Revit 2027 API
TableData.IsValidZoomLevel Method
 Verifies if the value of zoom level is valid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidZoomLevel(
	int zoomLevel
)
Public Function IsValidZoomLevel (
	zoomLevel As Integer
) As Boolean
public:
bool IsValidZoomLevel(
	int zoomLevel
)
member IsValidZoomLevel :
        zoomLevel : int -> bool
Parameters
zoomLevel Int32
 The value of zoom level.
Return Value
Boolean
 True if the value of zoom level is inside of the acceptable range, false otherwise.
See Also
Reference
TableData Class
Autodesk.Revit.DB Namespace